Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: གཟུགས་ལ་ཡོངས་སུ་མི་རྟོག་པའི་ཚོར་བ་ནི་གློག་དང་ནམ་མཁའ་བཞིན་ནོ། །
en: Feelings that do not conceptualize forms are like a flash of lightning and space.

source: འདུ་ཤེས་ནི་རླུང་དང་། ནམ་མཁའ་བཞིན་ནོ། །
en: Perceptions are like wind and space.

source: འདུ་བྱེད་རྣམས་ནི་སྤྲིན་མེད་པའི་ནམ་མཁའ་བཞིན་ནོ། །
en: Formations are like a cloudless sky.

source: རྣམ་པར་ཤེས་པ་ནི་སྨིག་རྒྱུ་བ་དང་ནམ་མཁའ་བཞིན་ནོ། །
en: Consciousnesses are similar to optical illusions and to space.

source: གཟུགས་ལ་ཡོངས་སུ་མི་རྟོག་ཅིང་ཐེར་ཟུག་ཏུ་མོས་ཏེ། མི་རྟག་པ་ཉིད་ཡོངས་སུ་མི་རྟོག་པ་འདི་ནི་སྲིད་པ་ཞེས་བྱའོ། །གཞན་ཡང་གཟུགས་ལ་སྡུག་བསྔལ་དུ་ཡོངས་སུ་མི་རྟོག་པ་དང་། སྒྲ་དང་དྲི་ལ་ཀུན་འབྱུང་བ་དང་། འགོག་པར་ཡོངས་སུ་མི་རྟོག་པ་དང་།
en: Not understanding forms and imagining them to be eternal, and thus not understanding their impermanent nature, is known as craving.

source: རོ་ལ་ལམ་དུ་ཡོངས་སུ་མི་རྟོག་པ་དང་། རེག་བྱ་ལ་སྐྱེ་བ་དང་། འགོག་པ་བརྗོད་དུ་མེད་པར་ཡོངས་སུ་མི་རྟོག་པ་འདི་ནི་སྲིད་པའི་གནས་ལ་ཆགས་པ། ཁམས་གསུམ་ཐམས་ཅད་དུ་འཕྲོ་བ། དུས་གསུམ་གྱི་དངོས་པོ་ལ་སྲེད་པའི་གནས་ཞེས་བྱའོ། །
en: Furthermore, not understanding that forms are suffering, not understanding that sounds and smells arise and cease, not understanding this with respect to taste, and not understanding that tactile objects arise and cease and are inexpressible is known as attachment to the basis of craving,the proliferation of the three realms, and the state of craving the objects of the three times.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ངན་པ་རྣམས་ནི་འཁོར་བའི་ཆུ་ཀླུང་གི་རྒྱུན་གྱི་ཤུགས་འབབ་པ་ལ་མངོན་པར་བརྩོན་པ་སྟེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ལ་འདི་ལྟར་ཚུལ་བཞིན་གྱིས་སོ་སོར་བརྟག་པར་བྱ་སྟེ། འབྱུང་བ་ཆེན་པོ་བཞིའི་གཟུགས་འདི་ནི་ནང་དང་། འགོད་པའི་མཚན་ཉིད་དོ། །
en: “While ignoble, foolish ordinary beings put great efforts into perpetuating the powerful waterfall of saṃsāra, bodhisattvas should analyze forms in each and every detail, from the ground up, as follows: Forms made of the four great elements have the characteristics of being diseased and ceasing.

source: གང་རབ་ཏུ་རྣམ་པར་འཇིག་པའི་མཚན་ཉིད་དེ་ནི་མི་རྟག་པ་སྟེ།
en: Whatever has the characteristic of disintegrating is impermanent.

source: ཇི་ལྟར་འབྱུང་བ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པ་སྔར་བསྟན་པ་དེ་བཞིན་དུ་སོ་སོར་བརྟག་གོ། །
en: Bodhisattvas should analyze each and every detail in the same way as analyzing the great elements described before.

source: འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་ནི་སྡོང་པོའི་ཚུལ་དུ་སོ་སོར་བརྟག་པར་བྱ་སྟེ།
en: They should analyze each of the five sense pleasures as one would analyze a pillar.

source: ཇི་ལྟར་སྡོང་པོ་ནམ་མཁའ་ལ་གནས་བཅས་ཏེ་མི་གནས་ཤིང་ས་ལ་བརྟེན་ཏེ། གནས་པ་དེ་བཞིན་དུ་གཟུགས་ནི་དབུ་བའི་གོང་བུ་ལྟ་བུ་སྟེ།
en: Just as a pillar might stand in the sky but is not based there because it is supported by the earth, so too the basis, forms, are like a mass of foam.

source: གཟུགས་དང་གཟུགས་མེད་པའི་རྣམ་པར་དམིགས་པས་གཟུགས་དང་གཟུགས་མེད་པ་ལ་འཇུག །གཟུགས་དང་གཟུགས་མེད་པ་དང་མི་འབྲལ།
en: By apprehending forms and the absence of forms, one becomes involved with forms and the absence of forms, and one is not free from forms and the absence of forms.

source: གཟུགས་དང་གཟུགས་མེད་པའི་ལས་དང་། གཟུགས་དང་གཟུགས་མེད་པ་སྤངས་ནས་དབུ་བའི་གོང་བུ་ལྟར་སྙིང་པོ་མེད་པར་བརྟགས་ན་སྟོང་པ་སྟེ།
en: However, if one discards the activity of forms and the absence of forms, as well as the forms and the absence of forms themselves, and considers those forms to have no essence, like a mass of foam, one will find that they are empty.

source: འཇུག་པ་དང་མི་འཇུག་པ་ནི་ཇི་ལྟར་རླུང་འདུས་པའི་རྐྱེན་གྱིས་ཁ་ནས་སྒྲ་འབྱུང་བ།
en: Whether they apply or they do not apply, words come forth from the mouth based on the condition of the breath.

source: ཡི་གེ་མེད་ཅིང་བརྗོད་དུ་མེད་པ་དེ་བཞིན་དུ་ཁམས་གསུམ་གྱི་སྒྲ་ཡང་སྟོང་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: They are wordless and inexpressible, and one should understand that the sounds of the three realms are empty in the same way.

source: ཇི་ལྟར་རླུང་འདུས་པ་དང་། ནམ་མཁའི་རླུང་དང་། ནམ་མཁའི་དྲི་མེད་དེ་སྟོང་པ་དེ་བཞིན་དུ་ཁམས་གསུམ་ཡང་དྲི་ལྟ་བུར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: One should understand the smells of the three realms in the same way that the breath contained in the body, the wind that courses through space, and space itself are without smells and empty.

source: ཇི་ལྟར་བུམ་པ་ཆར་པའི་ཐིགས་པས་གང་བ་ཡང་དེའི་ནང་དུ་སུས་ཀྱང་ཐིགས་པ་བླུགས་པ་མེད།
en: One should understand the quality of taste that oneself and the three realms possess is empty in the same way that a pot fills with drops of rain but there is no one who places the drops inside of it.

source: བསྒྲུབས་པ་མེད།
en: No one accomplishes this.

source: བྱས་པ་མེད།
en: No one does this or causes it to be done.

source: བྱེད་དུ་བཅུག་པ་མེད་དེ། ཐམས་ཅད་ཡོངས་སུ་བཟུང་བ་དང་།
en: So, it is entirely without anyone who takes hold of it and attends to it.

source: ཉེ་བར་སྤྱད་པ་དང་བྲལ་བ་དེ་བཞིན་དུ་ཁམས་གསུམ་བདག་དང་བཅས་པའི་རོའི་ཡོན་ཏན་ཡང་སྟོང་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །ཇི་ལྟར་བུམ་པ་གང་ཡང་ནམ་མཁའ་དང་འདྲེས་པར་བསྒྲུབས་པ་མེད་དེ། ཇི་ལྟར་ནམ་མཁའ་ལ་མ་ཡིན།
en: One should understand that the sense of touch related to the three realms is empty in the same way that a pot is not established as being conjoined with space.

source: ནམ་མཁའ་དང་བུམ་པ་ཕན་ཚུན་རེག་པ་དང་བྲལ་བ་སེམས་མེད་པ་དེ་བཞིན་དུ་ཁམས་གསུམ་གྱི་རེག་པ་ཡང་སྟོང་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: It is not in space, and space and the pot are free from contact with one another and are inanimate.

source: འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་གཏི་མུག་གི་འཁོར་ལོས་བུང་བ་མེ་ཏོག་གི་དྲི་ལ་ཆགས་པ་དེ་བཞིན་དུ་གང་ཡང་འདོད་པའི་སྲེད་པ་དང་།
en: The wheel of delusion regarding the five sense pleasures leads to craving some desire and craving some form just like a bee drawn to the smell of flowers.

source: གང་ཡང་གཟུགས་ཀྱི་སྲེད་པ་འདི་དག་ནི་འདོད་པའི་ཡོན་ཏན་ལྔའི་ཚུལ་གྱིས་སྟོང་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: One should realize that things are empty of the five sense pleasures.

source: གང་ཡང་གཟུགས་མེད་པའི་ཕུང་པོ་བཞི་ལ་སྲེད་པ་གཟུགས་མེད་པ་ནི་ཡི་གེ་མེད་པ་རང་བཞིན་མེད་པ་སྟེ།
en: “Craving for the four formless aggregates has no form, is wordless, and has no intrinsic nature.

source: ཅུང་ཟད་མ་ཡོད་པའི་ཚུལ་གྱིས་ཇི་ལྟར་སྔར་བསྟན་པ་བཞིན་དུ་སྟོང་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །ཇི་ལྟར་ནམ་མཁའ་ལ་བརྟེན་ཏེ།
en: One should understand that it is empty in the same way that not even the slightest thing exists, as was explained before.

source: རླུང་རྒྱུ་བ་ནི་ནམ་མཁའ་ལ་རླུང་གིས་འདྲེས་པར་བྱས་ཤིང་ཆགས་པ་ཡང་མེད་དེ། ནམ་མཁའ་ལས་ཀྱང་རླུང་ལ་མ་ཡིན་ཞིང་གཉི་ག་ཡང་བརྗོད་དུ་མེད་ཅིང་ཡི་གེ་མེད་པ་དེ་བཞིན་དུ་གཟུགས་མེད་པའི་ཕུང་པོ་ཡང་ཕན་ཚུན་དངོས་པོ་མེད་པར་འགྲུབ་ཅིང་ལྡན་པ་སྟེ། ཕན་ཚུན་གནོད་པ་དང་། སྦྱོར་བ་དང་། འདྲེ་བ་དང་།
en: The formless aggregates are established upon and possess a mutual insubstantiality just as the movement of the wind depends on space, but the wind does not mix together with or have attachment to space, the wind does not possess anything from space, and both are inexpressible and wordless.

source: གནོད་པར་བྱེད་པ་མེད་པ་དེ་བཞིན་དུ་ཕུང་པོ་འདི་དག་ཀྱང་ཆོས་ཐམས་ཅད་མི་སྐྱེ་བའི་ཚུལ་གྱིས་དངོས་པོའི་མཚན་ཉིད་དུ་ཉེ་བར་མི་འགྲོ་ཞིང་སྐྱེད་པ་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: In the same way, one should understand that these aggregates do not arrive at and do not produce real characteristics because all phenomena are unborn.

source: ཇི་ལྟར་ནམ་མཁའ་དང་། རླུང་དང་། གློག་ཡི་གེ་མེད་ཅིང་བརྗོད་དུ་མེད་དེ་ལྷན་ཅིག་ཏུ་རྒྱུ་ཡང་ཕན་ཚུན་ཆགས་པ་མེད་པ་བཞིན་དུ་མྱ་ངན་ལས་འདས་པ་ཡང་ཟད་པ་མེད་དོ། །
en: Just as space, wind, and light lack words, are inexpressible, and move together without being attached to each other, so too nirvāṇa is inexhaustible.

source: ཇི་ལྟར་མྱ་ངན་ལས་འདས་པ་ཟད་པ་ཡང་མ་ཡིན་མི་ཟད་པ་ཡང་མ་ཡིན་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་མྱ་ངན་ལས་འདས་པ་དང་མཉམ་སྟེ། མཉམ་པ་ཡང་མེད།
en: All phenomena are equal to nirvāṇa in the same way that nirvāṇa is neither an extinction nor not an extinction.

source: མི་མཉམ་པ་ཡང་མེད་ལ་གཉེན་པོ་མི་དམིགས་ཏེ།
en: One should not apprehend opposing factors in terms of lack of sameness and lack of difference.

source: གཉིས་སུ་བྱ་བ་མ་ཡིན་ཞིང་ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་དང་མཚུངས་པར་སྤྱོད་པར་ཤེས་ནས་ཆོས་ཀྱི་དབྱིངས་དང་ཡང་དག་པའི་མཐའ་ལ་སྐྱེ་བའམ། འགག་པ་ཅུང་ཟད་ཀྱང་མི་སེམས་ཏེ།
en: One should not create duality; after one understands that all phenomena behave in the same way as the realm of phenomena, one does not think that the realm of phenomena and ultimate reality arise or cease in the least.

source: དེས་ན་ཆོས་ཀྱི་དབྱིངས་ནི་གནས་མེད་པའི་མཐའ་སྟེ། དེ་ནི་ཡང་དག་པའི་མཐའོ། །
en: Thus, the nature of the realm of phenomena is groundless, and this is the ultimate reality.

source: གང་ཡང་དག་པའི་མཐའ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་མཐའོ། །
en: What is ultimately real is the nature of all phenomena.

source: དེ་ནི་དཀྱིལ་འཁོར་གསུམ་ཡོངས་སུ་གཅོད་པའི་མཐའོ། །
en: This is the position that circumscribes the three fields.

source: དེ་ནི་གཅོད་པ་མེད་ཅིང་འབྱེད་པ་མེད་པའི་མཐའོ། །
en: It is the position that is without boundary or division.

source: དེ་ནི་ཆད་པ་མེད་ཅིང་རྟག་པ་མེད་པའི་མཐའོ། །
en: It is the position that is without annihilation and permanence.

source: ཇི་ལྟ་བ་བཞིན་གྱི་མཐའ་སྟེ།
en: It is the position of things as they truly are.

source: མཐའ་དེས་ཆོས་ཐམས་ཅད་མཐར་གྱུར་པ་སྟེ།
en: With this position one encompasses all phenomena.

source: མཐའ་ཇི་སྙེད་པ་དང་། མཐའ་མེད་པ་ནི་མི་གཉིས་པ་སྟེ། སྲིད་པའི་སྲེད་པ་མི་དམིགས་པའི་ཕྱིར་རོ། །
en: The extent of this position and absence of this position are not two things, because one does not apprehend the craving for existence.

source: སྲོག་དང་འགྲོ་བ་དང་། གསོ་བ་དང་། གང་ཟག་ཐམས་ཅད་ནི་གཉིས་སུ་མེད་པའི་མཐའོ། །
en: The position regarding all things, such as the life force, the being, the soul, and the person, is one of nonduality.

source: ཡང་དག་པའི་མཐའ་དང་། འཇིག་ཚོགས་ཀྱི་མཐའ་དང་། སྲེད་པ་སེལ་བ་ཡང་མི་གཉིས་པའི་མཐའོ། །
en: The position regarding ultimate reality, the position of the transitory collection, and the elimination of craving are also nondual.

source: དེ་ལྟར་ན་འཇིག་ཚོགས་ཀྱི་མཐའ་དང་འདོད་པ་གཅོད་པ་ཡོད་དོ། །
en: And in that way, the position of the transitory collection is what eliminates desire.

source: དེ་ལྟར་རབ་ཏུ་ཤེས་ན་འཇིག་ཚོགས་ལ་ལྟ་བའི་ཆ་ཉི་ཤུར་འགྱུར་རོ། །
en: When one understands in that way, there will be twenty aspects to this view of the transitory collection.

source: ཡང་དག་པའི་མཐའ་ནི་སྲེད་པའི་འཇུག་པ་དང་མཚུངས་པ་ཉིད་མ་ཡིན་ནོ། །
en: Ultimate reality is not the same as involvement with craving.

source: ཡང་དག་པའི་མཐའ་ནི་སོང་བ་མེད་དོ། །
en: Ultimate reality is without going.

source: ནམ་སོང་བ་ན་ཟད་པ་མེད་འགོད་པ་མེད་དེ་ཤིན་ཏུ་མཐར་གྱུར་པ་དེ་བཞིན་དུ་སྲེད་པ་ཡང་མི་ཟད་པའི་སྒོ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱང་མི་ཟད་པའོ། །
en: It comes to an end in the sense that when it has gone it is not extinguished and is not established, and so craving is the gateway to the inexhaustible because all phenomena are inexhaustible and have no inherent nature.

source: རང་བཞིན་མེད་པའོ། །ཆོས་ཐམས་ཅད་མ་སྐྱེས་པར་ཤེས་ནས་ཀུན་ནས་བསྐོར་བ་ཐམས་ཅད་གཅོད་པ་ནི་བརྗོད་དུ་མེད་པའི་དོན་སངས་རྒྱས་ཀྱི་སྐུ་མཐའ་ཡས་པ་ཡོངས་སུ་འགྲུབ་པ་སྒྲུབ་པའི་བཟོད་པའི་སྒོའི་གཏེར་གྱི་གཟུངས་རབ་ཏུ་ཐོབ་བོ། །
en: “Bodhisattvas who understand the unborn nature of all phenomena and cut away all of them in their entirety attain the treasure dhāraṇī of the gateway to acceptance that accomplishes the inexpressible meaning and the manifestation of infinite buddha bodies.

source: གཟུངས་དེ་རབ་ཏུ་ཐོབ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་སྐུ་མངོན་པར་གྲུབ་པ་སྟོན་ཏེ། །
en: Once they have attained that dhāraṇī, those bodhisattvas display the manifestation of buddha bodies in the ten directions.

source: མིག་གི་མཉམ་པ་ཉིད་ལས་མི་གཡོ་བར་སེམས་ཅན་རྣམས་ལ་འཆི་འཕོ་དང་སྐྱེ་བ་ཡང་སྟོན་ལ། འཆི་འཕོ་ཡང་མེད་སྐྱེ་བ་ཡང་མེད། གང་དུ་ཡང་འགྲོ་ཞིང་འོང་བར་འཇུག་པ་ཡང་མེད།
en: Without wavering from the equanimity of their vision, they also demonstrate birth and death for beings, even though for them there is no death, no birth, nowhere that one goes, and no coming.

source: འདུ་བྱེད་རྣམས་ལ་རྣམ་པར་རྟོག་པ་ཡང་མེད་དོ། །
en: For them, formations are devoid of concepts.

source: དེ་ལྟར་དོན་དུ་གཉེར་ཞིང་མངོན་པར་རྟོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྐད་ཅིག་ལ་སྲེད་པ་ལ་ཞུགས་ནས་སྐད་ཅིག་མ་གཉིས་པ་ལ་ལེན་པ་མངོན་པར་འགྲུབ་བོ། །
en: “Bodhisattvas who strive in that way and gain such realization know that grasping comes into being in the second moment after one engages the moment of craving.

source: ལེན་པ་གང་ཞེ་ན།
en: What is grasping?

source: ལེན་པ་བཞི་སྟེ། འདོད་པའི་ལེན་པ་དང་། ལྟ་བའི་ལེན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ལེན་པ་དང་། བདག་ཏུ་སྨྲ་བའི་ལེན་པའོ། །
en: There are four types of grasping: grasping related to desire, grasping related to views, grasping related to discipline, and grasping related to the view of a self.

source: དེ་ལ་འདོད་པའི་ལེན་པ་གང་ཞེ་ན། འདོད་པའི་རོ་མྱོང་བར་བྱེད་པ་དང་།
en: What is grasping that is related to desire?

source: བདེ་བ་ལ་མངོན་པར་དགའ་ཞིང་མངོན་པར་ཆགས་ཞེན་པ་འདི་ནི་འདོད་པའི་ལེན་པ་ཞེས་བྱའོ། །
en: Grasping related to desire refers to attachment that relishes desires, delights in pleasure, and becomes strongly attached.

source: དེ་ལ་ལྟ་བའི་ལེན་པ་གང་ཞེ་ན།
en: What is grasping that is related to views?

source: ཆད་པའམ་རྟག་པ་ཞེས་བྱ་བ་ནས་ལྟ་བར་སོང་བ་དྲུག་ཅུ་རྩ་གཉིས་ཀྱི་བར་དེ་ནི་ལྟ་བའི་ལེན་པ་ཞེས་བྱའོ། །
en: Grasping related to views refers to everything from permanence and annihilation up to the sixty-two types of wrong views.

source: དེ་ལ་ཚུལ་ཁྲིམས་ཀྱི་ལེན་པ་གང་ཞེ་ན།
en: What is grasping that is related to discipline?

source: གང་དག་འཕགས་པའི་བསྟན་པའི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་དང་ཚངས་པར་སྤྱོད་པའི་གནས་དང་སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་དང་གང་ཡང་ཞགས་པ་འཐུབ་པ་དགུ་བཅུ་རྩ་ལྔའི་ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་དང་། ཚངས་པར་སྤྱོད་པའི་གནས་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་ལེན་པའོ། །གང་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Grasping related to discipline refers to the disciplines, the observances, the austerities, the state of living a religious life, the ascetic qualities, and the strict abstinence taught by the noble ones, as well as the disciplines, the observances, the austerities, the state of living a religious life, the ascetic qualities, and the strict abstinence of the ninety-five nirgranthas.

source: བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། ཤེད་ལས་སྐྱེས་པ་དང་། ཤེད་ཅན་དང་། བྱེད་པ་པོ་དང་། བྱེད་དུ་འཇུག་པ་དང་། ལྡང་བར་བྱེད་པ་དང་།
en: Grasping related to the view of a self refers to thinking, ‘The self, being, the life force, migrators, human beings, living creatures, agents, inducers of action, emerging, something that induces emergence, and the subject that feels, produces, and causes production arise and exist.’

source: ལྡང་བར་བྱེད་དུ་འཇུག་པ་དང་། ཚོར་བ་པོ་དང་། སྐྱེད་པ་པོ་དང་། སྐྱེད་དུ་འཇུག་པ་བྱུང་ཞིང་འབྱུང་བ་ཡོད་དོ་སྙམ་པ་འདི་ནི་བདག་ཏུ་སྨྲ་བའི་ལེན་པ་ཞེས་བྱ་སྟེ། དེ་དག་ནི་ལེན་པ་བཞིའོ། །
en: Those are the four types of grasping.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བརྗོད་དུ་མེད་པའི་ཚུལ་གྱིས་ཡང་དག་པ་མ་ཡིན་པ་དང་མ་བྱུང་བར་རྟོག་གོ། །
en: Bodhisattvas understand that those are inexpressible and therefore not real and unarisen.

source: ཆོས་ཐམས་ཅད་མཚན་ཉིད་གཅིག་སྟེ། དབྱེར་མེད་པའི་ཚུལ་གྱིས་དངོས་པོ་མེད་པ་དང་།
en: They understand that all phenomena have a single characteristic.

source: བརྗོད་དུ་མེད་པ་དང་། ཚིག་གི་ལམ་མ་ཡིན་པ་དང་། ཆུའི་ཟླ་བ་ལྟ་བུ་དང་། ནམ་མཁའ་ལ་རྟག་པའི་མཚན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པར་ཡོངས་སུ་རྟོག་གོ། །
en: That characteristic is understood as lacking any differentiation and as therefore insubstantial, inexpressible, beyond the realm of words, like the reflection of the moon in water, and like space, and the realm of phenomena is understood to lack any differentiation.

source: གང་ལ་འདོད་པའི་རོ་མྱང་ཞིང་མངོན་པར་དགའ་བ་དེ་ནི་སྡུག་བསྔལ་ལ་མངོན་པར་དགའ་བའོ། །
en: “When one delights in and relishes desires, one delights in suffering.

source: འདོད་པའི་གནས་སོ། །མངོན་པར་ཞེན་པའོ། །
en: That is the basis of desire, and that is clinging.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་མིག་གིས་ཤེས་པར་བྱ་བའི་གཟུགས་མཛེས་པ་སྡུག་པ་ཡིད་དུ་འོང་བ་མཐོང་ན། མིག་གི་རྣམ་པར་ཤེས་པ་ལ་མེའི་ཕུང་པོ་ཇི་ལྟ་བ་བཞིན་དུ་ཚུལ་བཞིན་གྱིས་རྟོག་སྟེ།
en: When bodhisattvas see pleasing, beautiful, and attractive forms with their eyes, they understand them in the right way as being like a mass of fire before the eye consciousness.

source: མིག་གི་རྣམ་པར་ཤེས་པས་བརྟག་ཏུ་མེད་པའི་ཕུང་པོ་དེ་ཡང་རྫས་མེད་པ། བརྗོད་དུ་མེད་པ་ཡི་གེ་མེད་པ། དངོས་པོ་མི་དམིགས་པར་རྟོག་གོ། །
en: They understand that those aggregates that are not discerned by the eye consciousness are also immaterial, inexpressible, wordless, and not apprehended as real things.

source: མིག་གི་རྣམ་པར་ཤེས་པ་དེ་ཡང་དངོས་པོ་མི་དམིགས་པའི་ཕྱིར་རྫས་མེད་པ། མཚན་ཉིད་མེད་པའོ། །
en: Since the eye consciousness is also not apprehended as a real thing, it is immaterial and without characteristics too.

source: ནམ་མཁའ་དང་།
en: Since space, fire, and the eyes are also not apprehended as real things, they are inexpressible and wordless too.

source: མེ་དང་། མིག་དེ་ཡང་དངོས་པོ་མི་དམིགས་པས་བརྗོད་དུ་མེད་ཅིང་ཡི་གེ་མེད་པ་དེ་བཞིན་དུ་གཟུགས་སྡུག་པ་ནས་འདོད་པ་དང་ལྡན་པའི་བར་དུ་མཐོང་ན་མིག་གི་རྣམ་པར་ཤེས་པ་དེ་དང་། གཟུགས་དེ་གཉི་ག་དང་། བར་གྱི་ནམ་མཁའི་བར་དུ་ཡང་དངོས་པོ་མི་དམིགས་སོ། །
en: Thus, when they perceive an attractive form, up to having a desire for it, they do not apprehend the eye consciousness or the form or even the intervening space as a real thing.

source: གང་གིས་མེ་མཐོང་བར་མིག་གི་རྣམ་པར་ཤེས་པ་སྐྱེས་ནས་དེ་འགགས་ཏེ་སྐད་ཅིག་མ་གཉིས་པ་ལ་གནས་པ་མ་ཡིན་ནོ། །
en: The eye consciousness that perceives fire arises and ceases, and is no longer present in the second moment.

source: སྐད་ཅིག་མ་གཉིས་པ་ལ་ཚོར་བ་སྐྱེ་སྟེ། ཇི་ལྟར་འོད་འཕྲོ་བའི་ཕུང་པོ་བཞིན་དུ་དམིགས་སོ། །
en: Feelings arise in the second moment, and bodhisattvas perceive them as masses of radiating light.

source: ཚོར་བ་དེ་ཡང་བརྗོད་དུ་མེད་པ། ཡི་གེ་མེད་པ། མཚན་མ་དང་བྲལ་བའོ། །
en: Those feelings are inexpressible, beyond words, and free from marks.

source: ཚོར་བ་སྐྱེས་ཏེ་འགགས་ནས་སྐད་ཅིག་མ་གཞན་གྱི་གནས་ལ་འདུ་ཤེས་སྐྱེ་སྟེ།
en: Feelings arise and cease and then perceptions arise as the basis of the next moment.

source: མེ་ལྕེ་འབར་བའི་འོད་འཕྲོ་བ་བཞིན་དུ་ཤེས་པར་བྱའོ། །
en: These are perceived like the radiating light of a blazing tongue of flame.

source: དེ་ཡང་འདུ་ཤེས་སྐྱེས་ནས་འགགས་པའི་བར་དུ་སྟེ། སྐད་ཅིག་མ་གཉིས་པའི་གནས་ལ་འདུ་བྱེད་རྣམས་སྐྱེ་སྟེ།
en: After those perceptions have arisen and ceased, formations arise as the basis of the second moment.

source: གང་ཆུང་ངུ་དང་། ཚད་མེད་པ་དང་། གང་རིང་བ་དང་། གང་ཉེ་བའི་འོད་འཕྲོ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Bodhisattvas perceive these as radiating lights that are either small or immeasurably large and either far or near.

source: འདུ་བྱེད་རྣམས་སྐྱེས་ནས་འགགས་པའི་བར་དུའོ། །སྐད་ཅིག་མ་གཞན་ལ་རྣམ་པར་ཤེས་པ་སྐྱེ་སྟེ།
en: Then, once those formations have arisen and ceased, consciousness arises in the next moment.

source: ཇི་ལྟར་འོད་འཕྲོ་བའི་ཕུང་པོ་སྐྱེ་བ་དང་འཇིག་པ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Bodhisattvas perceive that as a mass of radiating light that arises and disintegrates.

source: རྣམ་པར་ཤེས་པ་དེ་ཡང་བརྗོད་དུ་མེད་པ། ཡི་གེ་མེད་པར་གནས་པ།
en: This consciousness is inexpressible and a wordless state.

source: སྐད་ཅིག་གིས་འཇིག་པ་སྟེ།
en: It instantly disintegrates.

source: ནམ་མཁའ་ལ་བརྟག་པ་ལྟ་བུའོ། །
en: It is like something imputed upon space.

source: དེ་ལ་མེའི་བར་གྱི་ནམ་མཁའ་དེ་ཡང་རྫས་མེད་པ། བརྗོད་དུ་མེད་པ། ཡི་གེ་མེད་པའོ། །
en: The space around the fire is also insubstantial, inexpressible, and wordless.

source: གལ་ཏེ་འོད་འཕྲོ་བའི་ཕུང་པོ་གང་སྐྱེས་ནས་འབར་བ་དང་། འགག་པ་མཐོང་བ་ཐམས་ཅད་ཀྱང་ནམ་མཁའ་དང་མཚུངས་པའི་མཚན་ཉིད་དེ།
en: All those masses of radiating light that they see arise, blaze forth, and cease have the characteristic of being just like space.

source: བརྗོད་དུ་མེད་པ་དངོས་པོ་མེད་པ་སྟེ།
en: They are inexpressible and insubstantial.

source: འོད་འཕྲོ་བ་གཅིག་ཀྱང་རྐྱེན་མེད་པ། གྲངས་མེད་པའོ། །
en: They are innumerable, and each of their light rays is without conditions.

source: ཆོས་འདི་དག་ཐམས་ཅད་སྐྱེ་ཞིང་འགག་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་སྐྱེ་བ་དང་། འགག་པ་དང་། ནམ་མཁའ་ལ་བརྟག་པ་ལྟ་བུ་དང་། བརྗོད་དུ་མེད་པ་དང་།
en: Bodhisattvas should analyze the five sense pleasures that arise and cease in the same way that they analyze all of the phenomena that arise and cease—that they are like imputations in space, inexpressible, and insubstantial.

source: དངོས་པོ་མེད་པར་བརྟག་ཅིང་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: They should cultivate the acceptance of this fact.”

source: དོན་འདི་དག་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་ཏེ། དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །གཟུགས་ནི་མེ་ཡི་ཕུང་པོ་འདྲ། །
en: The Blessed One then expressed this point in the following verses: “Forms are like a mass of fire.

source: འདོད་པ་ཡང་དག་ཉིད་མཐོང་ནས། །མིག་གི་རྣམ་ཤེས་འདུས་མ་བྱས། །མིག་ནི་འོད་འཕྲོ་འདྲ་བར་ཤེས། །གཉི་ག་རྫས་དང་བྲལ་བ་སྟེ། །
en: Those who see the nature of desires Know that the eye consciousness is unconditioned, And that the eye is like radiating light.

source: བརྗོད་དུ་མེད་ཅིང་ཡི་གེ་མེད། །འོད་འཕྲོ་སྨིག་རྒྱུ་འདྲ་བ་སྟེ། །
en: “Both are immaterial, Inexpressible, and wordless, Like radiating lights or optical illusions.

source: རྣམ་པར་ཤེས་པ་སྒྱུ་མ་འདྲ། །
en: Thus consciousness is like an illusion.

source: མྱུར་དུ་སྐྱེ་ཞིང་འཇིག་པ་ཡང་། །གཉི་ག་དངོས་པོ་མེད་པ་སྟེ། །
en: “It arises and disintegrates instantly.

source: སྐད་ཅིག་གཉིས་པར་འོད་འཕྲོ་ཡི། །དྲོ་བ་ཐ་དད་ཤེས་པ་མེད། །
en: Both are insubstantial, because The heat of that radiating light in the second moment Is not understood as something separate from it.

source: སྐྱེས་ནས་སྐད་ཅིག་འཇིག་པ་ཡི། །ཚོར་བ་ཆུ་ཡི་ཆུ་བུར་འདྲ། །
en: “The feelings that arise and disintegrate in a moment Are like water bubbles.

source: འདུ་ཤེས་དེ་ཡང་མེ་ལྕེ་ལྟར། །རབ་ཏུ་ཤེས་ཏེ་མཚན་ཉིད་མེད། །
en: Perceptions are understood as being like A tongue of flame and lack characteristics.

source: འདུ་ཤེས་དང་ནི་འདུ་བྱེད་རྣམས། །སྐད་ཅིག་གཉིས་ལ་འགོག་པའོ། །
en: “Perceptions and formations Cease in the second moment.

source: ཚད་མེད་དག་དང་ཆུང་ངུ་ཡང་། །འོད་འཕྲོའི་ཕུང་པོ་འདྲ་བར་ཤེས། །
en: They are understood as being like masses of radiating light That are either immeasurably large or small.

source: འདུ་བྱེད་རྣམས་ནི་འགོག་པ་ལྟར། །དེ་ལྟར་རྣམ་ཤེས་རྗེས་སུ་འགྲོ། །
en: “As formations cease, They are followed by consciousness.

source: འགགས་ནས་ཀྱང་ནི་ཡང་སྐྱེ་སྟེ། །འོད་འཕྲོ་ཕུང་པོ་འདྲ་བར་ཤེས། །
en: It arises after they have ceased, And it is perceived as a mass of radiating light.

source: དེ་ལྟར་འོད་འཕྲོ་རྫས་མེད་དེ། །གཟུགས་རྣམས་མཐོང་བ་སྒྱུ་མ་བཞིན། །མྱུར་ཞིང་གཡོ་བ་མེད་བཞིན་དུ། །
en: “Since it is an immaterial radiating light, The forms it perceives are like an illusion That is instantaneous and unmoving.

source: ཕུང་པོ་ལྔ་རྣམས་རྗེས་སུ་འཇུག །
en: The same applies to the five aggregates.

source: ནམ་མཁའ་ལ་ནི་རྒྱུ་བ་ཀུན། །མེ་ཡི་ཕུང་པོ་འབར་བ་འདྲ། །
en: “Everything that moves through space Is like a blazing mass of fire.

source: རྫས་ཡོད་མ་ཡིན་བརྗོད་མེད་དེ། །
en: It is immaterial and inexpressible.

source: དེ་དག་ཐམས་ཅད་དངོས་པོ་མེད། །
en: Everything is insubstantial.

source: དེ་ལྟར་འདོད་པའི་ལེན་པ་ཡང་། །འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་དགའ། །སྐད་ཅིག་འཇིག་པའི་རྒྱུན་དག་ཀྱང་། །ཐམས་ཅད་སྟོང་པ་དངོས་པོ་མེད། །
en: “Grasping that is related to desires Refers to fondness for the five sense pleasures; The streams of moments that instantly disintegrate Are all empty and insubstantial.

source: བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་མེད་པ། །
en: “Bodhisattvas are fearless.

source: དེ་ལྟར་འདོད་པ་རྣམས་བརྟགས་ནས། །འདོད་སེམས་ཡོངས་སུ་ཟད་བྱེད་ཅིང་། །ཚུལ་བཞིན་དུ་ནི་བཟོད་པ་སྒོམ། །
en: So, they analyze desire, Put a stop to thoughts of desire, And cultivate acceptance in the correct way.

source: འདོད་པ་རྣམས་ནི་མེ་འདྲ་སྟེ། །རོ་མྱང་བྱ་བའི་མི་རིགས་སྟོན། །
en: “They teach humans who relish desires That desires are like fire.

source: སྒྱུ་མ་སྨིག་རྒྱུ་ཚུལ་གྱིས་ནི། །ཚོར་བ་ཆུ་ཡི་ཆུ་བུར་འདྲ། །
en: Because they are like an illusion, Feelings are like water bubbles.

source: གང་གིས་འདོད་པ་ཤེས་བྱེད་པའི། །རྣམ་པར་ཤེས་པ་སྒྱུ་མ་འདྲ། །ཐམས་ཅད་ནམ་མཁའ་འདྲ་བར་ཡང་། །
en: “The consciousness that cognizes desires Is also like an illusion And everything is like space.

source: དེ་ལྟར་བཟོད་པ་རྣམ་པར་སྒོམ། །
en: That is how they cultivate acceptance.

source: རིགས་ཀྱི་བུ་དེ་ལ་ལྟ་བའི་ལེན་པ་གང་ཞེ་ན། རིགས་ཀྱི་བུ་གང་ཕུང་པོ་ལྔ་ལ་བརྟག་པར་ལྟ་བ་སྟེ། གནས་སུ་སྙེམས་པ་དང་། ཡང་དག་པ་མ་ཡིན་པ་ཀུན་ཏུ་རྟོག་པ་དང་།
en: “Noble son, what is the grasping related to views?
